In [1]:
import pandas as pd

In [2]:
a=[1,2,3,4,5,6,7,8,9]

In [3]:
pd.Series(a)

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
dtype: int64

In [4]:
a={'ashwin':'Muthiah',"ajith":"Venkatesulu","gowthem":"genepure"}
s= pd.Series(a)
s

ashwin         Muthiah
ajith      Venkatesulu
gowthem       genepure
dtype: object

In [5]:
s.index

Index(['ashwin', 'ajith', 'gowthem'], dtype='object')

In [6]:
s.iloc[2]

'genepure'

In [7]:
s['ashwin']

'Muthiah'

In [8]:
s[0]

'Muthiah'

In [9]:
b={99:'ashwin',100:"muthiah",101:"rock"}

In [11]:
b[99]

'ashwin'

In [12]:
b[99]

'ashwin'

In [13]:
c=pd.Series(b)

In [14]:
c

99      ashwin
100    muthiah
101       rock
dtype: object

In [15]:
s[0]

'Muthiah'

In [16]:
c.iloc[0]

'ashwin'

In [17]:
c

99      ashwin
100    muthiah
101       rock
dtype: object

In [18]:
c.loc[99]

'ashwin'

In [19]:
c.iloc[0]

'ashwin'

In [20]:
import numpy as np

In [21]:
s=pd.Series(np.random.randint(1,1000,10000))

In [22]:
s

0       315
1       549
2         1
3       619
4       403
5       528
6       873
7       201
8        93
9        28
10      542
11       76
12      918
13      336
14      418
15      655
16      961
17      302
18      529
19      713
20      300
21      754
22      673
23      618
24      753
25      966
26      330
27      154
28      100
29      806
       ...
9970    653
9971    727
9972    979
9973    377
9974    557
9975    372
9976    150
9977    176
9978     62
9979     29
9980    569
9981    508
9982    899
9983    187
9984    649
9985    747
9986    671
9987    318
9988    803
9989    906
9990    506
9991    826
9992    957
9993    461
9994    559
9995    210
9996    603
9997    474
9998    964
9999     83
Length: 10000, dtype: int32

In [23]:
%%timeit -n 100
sum=0
for i in s:
    sum=sum+i

1.52 ms ± 57.6 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [24]:
%%timeit -n 100
a=np.sum(s)

219 µs ± 26.7 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [25]:
sunject={1:"a",2:"b"}
a=pd.Series(sunject)

In [26]:
a

1    a
2    b
dtype: object

In [27]:
a.loc[3]='c'

In [28]:
a

1    a
2    b
3    c
dtype: object

In [29]:
original_sports = pd.Series({'Archery': 'Bhutan',
                             'Golf': 'Scotland',
                             'Sumo': 'Japan',
                             'Taekwondo': 'South Korea'})

In [30]:
cricket_loving_countries = pd.Series(['Australia',
                                      'Barbados',
                                      'Pakistan',
                                      'England'], 
                                   index=['Cricket',
                                          'Cricket',
                                          'Cricket',
                                          'Cricket'])

In [31]:
all_countries = original_sports.append(cricket_loving_countries)

In [32]:
all_countries

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
Cricket        Australia
Cricket         Barbados
Cricket         Pakistan
Cricket          England
dtype: object

In [33]:
all_countries.iloc[1]

'Scotland'

In [34]:
all_countries.loc["Cricket"]

Cricket    Australia
Cricket     Barbados
Cricket     Pakistan
Cricket      England
dtype: object

In [38]:
pur1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
pur2 = pd.Series({'Name': 'ashwin',
                        'Item Purchased': 'shampoo',
                        'Cost': 22.50})
pur3=pd.Series({'Name': 'ashwin',
                        'Item Purchased': 'mouse',
                        'Cost': 22.50})

In [39]:
ds=pd.DataFrame([pur1,pur2,pur3],index=['s1','s1','s3'])

In [40]:
ds

      Name Item Purchased  Cost
s1   Chris       Dog Food  22.5
s1  ashwin        shampoo  22.5
s3  ashwin          mouse  22.5

In [46]:
ds['Name']

s1     Chris
s1    ashwin
s3    ashwin
Name: Name, dtype: object

In [48]:
ds.loc['s1']

      Name Item Purchased  Cost
s1   Chris       Dog Food  22.5
s1  ashwin        shampoo  22.5

In [49]:
a=ds.T

In [50]:
a

                      s1       s1      s3
Name               Chris   ashwin  ashwin
Item Purchased  Dog Food  shampoo   mouse
Cost                22.5     22.5    22.5

In [52]:
a.loc['Name']

s1     Chris
s1    ashwin
s3    ashwin
Name: Name, dtype: object

In [53]:
a.iloc[0]

s1     Chris
s1    ashwin
s3    ashwin
Name: Name, dtype: object

In [54]:
ds

      Name Item Purchased  Cost
s1   Chris       Dog Food  22.5
s1  ashwin        shampoo  22.5
s3  ashwin          mouse  22.5

In [56]:
ds.loc['s1','Cost']

s1    22.5
s1    22.5
Name: Cost, dtype: float64

In [57]:
ds.iloc[0]

Name                 Chris
Item Purchased    Dog Food
Cost                  22.5
Name: s1, dtype: object

In [59]:
ds.drop('s1')

      Name Item Purchased  Cost
s3  ashwin          mouse  22.5

In [60]:
ds

      Name Item Purchased  Cost
s1   Chris       Dog Food  22.5
s1  ashwin        shampoo  22.5
s3  ashwin          mouse  22.5

In [61]:
a=ds.drop('s1')

In [62]:
a

      Name Item Purchased  Cost
s3  ashwin          mouse  22.5

In [64]:
b=ds.T.drop('Name')

In [65]:
b

                      s1       s1     s3
Item Purchased  Dog Food  shampoo  mouse
Cost                22.5     22.5   22.5

In [67]:
ds.location=['none']

C:\Users\ashwi\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  """Entry point for launching an IPython kernel.

In [72]:
ds['location']= None

In [73]:
ds

      Name Item Purchased  Cost location
s1   Chris       Dog Food  22.5     None
s1  ashwin        shampoo  22.5     None
s3  ashwin          mouse  22.5     None